---
title: ""exception exit: disconnected" when reading old 0.13.0 riak data with	protobuf client"
description: ""
project: community
lastmod: 2012-09-24T11:38:04-07:00
sitemap:
  priority: 0.2
layout: mailinglistitem
mailinglist_id: "msg08673"
author_name: "Yuri Lukyanov"
project_section: "mailinglistitem"
sent_date: 2012-09-24T11:38:04-07:00

---


Hi,

I have a cluster with old 0.13.0 riak nodes installed. Erlang native API
client is used to get/put data to/from the cluster.
Now I'm trying to start using protobuf client (riakc\_pb\_socket). The
problem is that the pb client can't read data saved with old native
riak\_client.
Steps to reproduce:

1> {ok, C} = riak:client\_connect('riak@localhost').
{ok,{riak\_client,riak@localhost,<<4,81,114,138>>}}
2> C:put(riak\_object:new(<<"test">>, <<"key">>, {1, 2})).
ok
3> C:get(<<"test">>, <<"key">>).
{ok,{r\_object,<<"test">>,<<"key">>,
 [{r\_content,{dict,2,16,16,8,80,48,
 {[],[],[],[],[],[],[],[],[],[],[],[],...},
 {{[],[],[],[],[],[],[],[],[],[],...}}},
 {1,2}}],
 [{<<106,124,17,114,80,92,14,183>>,{1,63515448872}},
 {<<7,141,174,80>>,{1,63515448872}},
 {<<131,98,4,179,111,197>>,{1,63515729078}},
 {<<5,81,122,124>>,{1,63515729078}},
 {<<4,81,114,138>>,{1,63515729568}},
 {<<131,98,3,57,103,94>>,{1,63515729568}}],
 {dict,1,16,16,8,80,48,
 {[],[],[],[],[],[],[],[],[],[],[],[],[],...},
 {{[],[],[],[],[],[],[],[],[],[],[],...}}},
 undefined}}
4> {ok, Pid} = riakc\_pb\_socket:start\_link("localhost", 8087).
{ok,<0.13770.0>}
5> riakc\_pb\_socket:get(Pid, <<"test">>, <<"key">>).
\*\* exception exit: disconnected

On erlang node, the following error occurs:

=ERROR REPORT==== 24-Sep-2012::22:12:48 ===
\*\* Generic server <0.4086.41> terminating
\*\* Last message in was {tcp,#Port<0.96519>,
 [9|<<10,4,116,101,115,116,18,3,107,101,121>>]}
\*\* When Server state == {state,#Port<0.96519>,
 {riak\_client,riak@localhost
,<<3,139,240,244>>},
 undefined,undefined}
\*\* Reason for termination ==
\*\* {function\_clause,[{riakclient\_pb,encode,[1,{1,2}]},
 {riakclient\_pb,pack,5},
 {riakclient\_pb,iolist,2},
 {riakclient\_pb,encode,2},
 {riakclient\_pb,pack,5},
 {riakclient\_pb,pack,5},
 {riakclient\_pb,iolist,2},
 {riakc\_pb,encode,1}]}


I suppose that it is somehow connected with the fact that the value is
passed as an erlang term, not as clear binary data ({1, 2} vs
term\_to\_binary({1, 2})).

Is there something I can do about that? Btw, where can I
find riakclient\_pb.erl source code?
\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_
riak-users mailing list
riak-users@lists.basho.com
http://lists.basho.com/mailman/listinfo/riak-users\_lists.basho.com

